# [費用]如何計算
# (1)如果是減價時段, 每60分鐘300元, 未滿60分鐘部份, 每分鐘6元.
# (2)如果不是減價時段, 每60分鐘480元, 未滿60分鐘部份, 每分鐘9元.

# 例如, 有人在[減價時段]租用了920分鐘;
# [費用] = 300*15 + 6*20 = 4,620元.
# coding=utf-8
import m02

# ----------------------------------------
# 序號, 姓名, 是否優惠時段, 租用分鐘數
# ----------------------------------------
for no, name, isDiscount, minutes in [('120001', '蔡家雅', False, 920), ('120002', '張怡宇', False, 315), ('120003', '王庭棋', True, 134), ('120004', '黃和夫', True, 212), ('120005', '林于文', False, 633), ('120006', '唐馨馨', True, 321), ('120007', '張韻庭', False, 40), ('120008', '應立煌', True, 125), ('120009', '賀家政', False, 251), ('120010', '游惠嘉', True, 541), ('120011', '林佑倫', False, 120), ('120012', '孫宥葳', False, 231), ('120013', '黃岑秀', True, 140), ('120014', '楊雅柔', False, 280), ('120015', '李至君', True, 175)]:
    # 呼叫模組中的函式
    tot = m02.fee(isDiscount, minutes)

    # 印出結果
    print('序號:{}, 姓名：{},費用：{}'.format(no, name, tot))
